---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsMinAutomaticLandingDepth
source: html/2977b574-ef43-b591-b387-dc40d9adad6a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsMinAutomaticLandingDepth Property

"Minimum Automatic Landing Depth": The minimum depth of automatic landing

## Syntax (C#)
```csharp
public static ForgeTypeId StairsMinAutomaticLandingDepth { get; }
```